liste1 = [1,2,3,4,5]
liste2 = [i*2 for i in liste1]
print(liste2)
 
"""
Çıktı
[2, 4, 6, 8, 10]
"""

***************************************************************

liste3 = [[1,2,3],[4,5,6,7,8],[9,10,11,12,13,14,15]]
liste4 = list()
for i in liste3:
    for x in i:
        liste4.append(x)
print(liste4)
 
"""
Çıktı
[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]
"""

**************************************************************

# List Comprehension 
 
liste = [[1,2,3],[4,5,6,7,8],[9,10,11,12,13,14,15]]
liste2 = [x for i in liste for x in i] # Biraz karmaşık
print(liste2)
 
"""
Çıktı
[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]
"""
